Repository: hxml16/secmemo
Catalog: secmemo/SupportingFiles/*.lproj/Localizable.strings
Languages: ru

# common.cancel
source: Cancel
ru: Отмена

# common.error
source: Error
ru: Ошибка

# common.success
source: Success
ru: Успех

# common.alert.settings
source: Settings
ru: Настройки

# common.delete
source: Delete
ru: Удалить

# error.unknown
source: Unknown error
ru: Неизвестная ошибка

# error.initStorageFailed
source: Failed to initialize data storage. Unable to continue
ru: Невозможно ининциализировать хранилище данных. Работа приостановлена.

# error.memoStorageFailed
source: Failed to initialize data storage for this memo. Unable to continue.
ru: Не удалось инициализировать хранилище для данной записи. Работа приостановлена.

# error.locationServiceUnavailable
source: Geolocation service is unavailable. Please enable it in the app settings
ru: Служба геолокации недоступна. Пожалуйста, влючите ее в настройках

# error.locationInvalid
source: Location you provided is invalid. Please follow a proper format for latitude and longitude.
ru: Вы ввели неверное значение. Пожалуйста, используйте правильный формат для широты и долготы

# signUp.welcomeLabelTitle
source: Welcome
ru: Приветствую

# signUp.securityCodeLabelTitle
source: Security pincode
ru: Пинкод безопасности

# signUp.emergencyCodeLabelTitle
source: Emergency pincode
ru: Аварийный пинкод

# signUp.securityCodeDescription
source: This app allows you to create and keep your sensitive notes protected by a security pincode. So before start using the app you need to setup this pincode.
ru: Данное приложение предназначено для надежного хранения ваших заметок путем защиты пинкодом безопасности. Для начала работы необходимо создать этот пинкод

# signUp.emergencyCodeDescription
source: Optionally you can setup an emergency pincode. You can use it when you need to destroy urgently all data stored in the app. You may skip this step and setup this pincode later in the App settings.
ru: Дополнительно вы можете создать аварйиный пинкод. Если использовать данный код для входа, все записи будут уничтожены Можно пропустить сейчас этот шаг и настроить аварийный пинкод позже в настройках приложения

# signUp.securityCodeCreateButton
source: SETUP SECURITY PINCODE
ru: СОЗДАТЬ ПИНКОД БЕЗОПАСНОСТИ

# signUp.emergencyCodeAgreementText
source: I understand the purpose of the emergency code
ru: Я понимаю, для чего нужен аварийный пинкод

# signUp.emergencyCodeCreateButton
source: SETUP EMERGENCY PINCODE
ru: СОЗДАТЬ АВАРИЙНЫЙ ПИНКОД

# signUp.emergencyCodeSkipButton
source: Skip
ru: Пропустить

# pinCode.unlockTitle
source: Enter pincode
ru: Введите пинкод

# pinCode.setupSecurityPincodeTitle
source: Setup security pincode
ru: Задайте код безопасности

# pinCode.setupEmergencyPincodeTitle
source: Setup emergency pincode
ru: Задайте аварийный код

# pinCode.repeatSecurityPincodeTitle
source: Repeat security pincode
ru: Повторите код безопасности

# pinCode.repeatEmergencyPincodeTitle
source: Repeat emergency pincode
ru: Повторите аварийный код

# pinCode.pincodesMismatchTitle
source: Typed pincodes mismatch. Try again.
ru: Введенные пинкоды не совпадают. Попробуйте еще раз

# pinCode.pincodesCreatedTitle
source: Pincode successfully created. Don't forget it!
ru: Пинкод успешно создан. Не забывайте его

# pinCode.pincodesMatch
source: Pincodes match! Please choose some other pincode
ru: Пинкоды совпадают! Пожалуйста, придумайте другой аварийный пинкод

# pinCode.changeSecurityPincodeTitle
source: Enter security pincode to change pincode
ru: Для смены пинкода, введите текущий пинкод безопасности

# pinCode.changeEmergencyPincodeTitle
source: Enter security pincode to change pincode
ru: Для смены пинкода, введите текущий пинкод безопасности

# memos.navigationBarTitle
source: Memos
ru: Заметки

# memos.deleteItemConfirmText
source: Item "%@" will be completely deleted
ru: Запись "%@" будет бeзвозвратно удалена.

# memos.noMemosYet
source: You haven't added any memos yet.
ru: Вы пока не добавили ни одной записи.

# memoEdit.navigationBarTitle
source: Memo
ru: Заметка

# memoEdit.newMemoTitle
source: Memo #%@
ru: Запись #%@

# memoEdit.addItemsLabelTitle
source: Add any text, photo or geolocation
ru: Добавляйте тексты, изображения и геолокации

# memoEdit.addTextButtonTitle
source: Text
ru: Текст

# memoEdit.addFromCameraButtonTitle
source: From camera
ru: Камера

# memoEdit.addFromPhotosButtonTitle
source: From gallery
ru: Фото

# memoEdit.addLocationButtonTitle
source: Location
ru: Локация

# memoEdit.textViewPlaceHolderText
source: Type or paste your text here
ru: Введите или вставьте текст

# memoEdit.locationTextFieldPlaceHolderText
source: Type or paste GPS coordinates here
ru: Введите или вставьте GPS координаты

# memoEdit.replaceCurrentLocation
source: Previous location value will be replaced
ru: Предыдущее значение геолокации будет изменено

# memoEdit.confirmEntryDeletion
source: This line will be delteted
ru: Данная строка будет удалена

# memoEdit.confirmImageDeletion
source: This image will be deleted
ru: Данное изображение будет удалено

# memoEdit.replaceButtonTitle
source: Replace
ru: Заменить

# settings.navigationBarTitle
source: Settings
ru: Настройки

# settings.pincodeSettingsDescription
source: Security pincode is used to unlock the app and access its data
ru: Пинкод безопасности используется для разблокировки приложения и доступа к данным

# settings.emergencyPincodeSettingsDescription
source: Emergency pincode is used for imediate deletion of data and then unlock the app. Use it carefully, confirmation is not asked!
ru: Аварийный пинкод используется для мгновенного удаления всех данных с последущей разблокировкой. Используете его с осторожностью, подтверждение не спрашивается!

# settings.disableSecurityPincodeConfirmTitle
source: Disabling security pincode makes your data unprotected. Emergency pincode will also be disabled
ru: Деактивация пинкода безопасности сделает ваши данные незащищенными. Аварийный код будет также деактивирован

# settings.disableEmergencyPincodeConfirmTitle
source: You won't be able to emergency remove all data if you disable emergency pincode
ru: Аварийное удаление данных будет невозможно, если деактивировать аварийный пинкод

# settings.disableButtonTitle
source: Disable
ru: Деактивировать

# settings.clearAllDataButtonTitle
source: Clear all data
ru: Очистить все данные

# settings.clearAllDataConfirmTitle
source: All memos will be deleted
ru: Все заметки будут удалены
